{"text_snippet": {"content": "The carboxyl group of a fatty acid can form a covalent bond\nwith the hydroxyl group of glycerol, resulting a functional\ngroup called an ester and water (Figure 3.18).\nThe three fatty acids in a triglyceride molecule need not\nall have the same hydrocarbon chain length or structure:\nIn saturated fatty acids, all the bonds between the carbon atoms in the hydrocarbon chain are single bonds—\nthere are no double bonds. That is, all the bonds are saturated with hydrogen atoms (Figure 3.19a). These fatty\nacid molecules are relatively rigid and straight, and they\npack together tightly, like pencils in a box.\nIn unsaturated fatty acids, the hydrocarbon chain contains one or more double bonds. Oleic acid, for example,\nis a monounsaturated fatty acid that has one double bond\nnear the middle of the hydrocarbon chain, which causes\na kink in the molecule (Figure 3.19b). Some fatty acids\nhave more than one double bond—are polyunsaturated—\nand have multiple kinks. These kinks prevent the molecules from packing together tightly.\nThe kinks in fatty acid molecules are important in determining the fluidity and melting point of a lipid. The triglycerides\nof animal fats tend to have many long-chain saturated fatty\nacids, packed tightly together; these fats are usually solids at\nroom temperature and have a high melting point. The\ntriglycerides of plants, such as corn oil, tend to have short or\nunsaturated fatty acids. Because of their kinks, these fatty\nacids pack together poorly and have a low melting point, and\nthese triglycerides are usually liquids at room temperature.\nFats and oils are marvelous storehouses for energy. When\nthey take in excess food, many animal species deposit fat\ndroplets in their cells as a means of storing energy. Some\nplant species, such as olives, avocados, sesame, castor beans,\nand all nuts, have substantial amounts of lipids in their seeds\nO C\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nO C\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\n+\nGlycerol\n(an alcohol)\n3\nFatty acid\nmolecules\nTriglyceride\nO H\nH2C\nO H\nCH2\nO H\nC\n3\nEster linkage\nO\nH2C C CH2\nO O\nH2O\nThe synthesis of an\nester is a condensation reaction.\nO C\nOH\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nO C\nOH\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nO C\nOH\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nO C\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nH H\n3.18 Synthesis of a Triglyceride\nIn living things, the reaction that forms\ntriglycerides is more complex, but the\nend result is as shown here.\n(a)\nO C\nOH\n(b)\nCH2\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nCH2\nH2C\nO 1C\nOH\nCH2\nCH2\nCH2\nCH2\nCH2\nCH2\nCH2\nCH2\n18CH3\nCH2\nCH2\nCH2\nCH2\n12HC\nHC\n9HC\nHC\nCH2\nH2C\nCH2\nH2C\nCH3\nH2C\nAll bonds between\ncarbon atoms are single\nin a saturated fatty acid\n(carbon chain is straight).\nA double bond between\ntwo carbons makes an\nunsaturated fatty acid\n(carbon chain has kinks).\nThe straight chain allows a molecule to\npack tightly among other similar\nmolecules. Kinks prevent close packing.\nPalmitic acid\nLinoleic acid\n3.19 Saturated and Unsaturated Fatty\nAcids (a) The straight chain of a saturated fatty acid allows the molecule to\npack tightly among other similar molecules. (b) In unsaturated fatty acids, kinks\nin the chain prevent close packing.\n51\nor fruits that serve as energy reserves for the next generation.\nThis energy can be tapped by people who eat these plant oils\nor use them for fuel. Indeed, the famous German engineer\nRudolf Diesel used peanut oil to power one of his early automobile engines in 1900."}, "annotations": []}
