{"text_snippet": {"content": "Polysaccharides are giant polymers of monosaccharides connected by glycosidic linkages (Figure 3.16).\nStarch is a polysaccharide of glucose with α-glycosidic\nlinkages.\nGlycogen is a highly branched polysaccharide of glucose.\nCellulose is also a polysaccharide of glucose, but its\nindividual monosaccharides are connected by β-glycosidic linkages.\nStarch actually comprises a large family of giant molecules\nof broadly similar structure. While all starches are large polymers of glucose with α linkages (Figure 3.16a), the different\nstarches can be distinguished by the amount of branching\nthat occurs at carbons 1 and 6 (Figure 3.16b). Some plant\nstarches are unbranched, as in plant amylose; others are moderately branched, as in plant amylopectin. Starch readily\nbinds water, and when that water is removed, unbranched\nstarch tends to form hydrogen bonds between the polysaccharide chains, which then aggregate. This is what causes\nbread to become hard and stale. Adding water and gentle\nheat separates the chains and the bread becomes softer.\nThe polysaccharide glycogen stores glucose in animal livers and muscles. Starch and glycogen serve as energy storage compounds for plants and animals, respectively. These\npolysaccharides are readily hydrolyzed to glucose monomers, which in turn can be further degraded to liberate their\nstored energy and convert it to forms that can be used for cellular activities. If it is glucose that is actually needed for fuel,\nwhy must it be stored as a polymer? The reason is that 1,000\nglucose molecules would exert 1,000 times the osmotic pressure (causing water to enter the cells; see Chapter 5) of a single glycogen molecule. If it were not for polysaccharides,\nmany organisms would expend a lot of time and energy expelling excess water.\nCellulose is the predominant component of plant cell\nwalls, and is by far the most abundant organic (carbon-containing) compound on Earth. Starch can be easily degraded\nby the actions of chemicals or enzymes. Cellulose, however,\nis chemically more stable because of its β-glycosidic linkages\n(Figure 3.16a). Thus starch is a good storage medium that can\nbe easily broken down to supply glucose for energy-producing reactions, while cellulose is an excellent structural material that can withstand harsh environmental conditions without changing."}, "annotations": []}
